package day01;//包 包名day01 ------樓+單元

public class HelloWorld {//類 類名HelloWorld--------房子

    //main 功能 : 程序的主入口  運行程序必須要有main功能!
    //main 快捷鍵: 快速生成main 功能 在類中空白區域英文狀態下敲main 有提示迴車即可
    public static void main(String[] args) {
        //大門 代碼需要運行則放在大門裡

        //打應功能:主要負責輸出打硬的信息(文字,數字,符號、、、、)
        //sout快捷鍵:快速生成打印語句
        //注意，文字，字母，符號等特殊內容若需要打印，需要放在雙引號裡面才可以""
        //數值的數據，都可以直接放在小括號中打印()輸出

        /**程序的執行:順序執行
         * 1.Java是嚴格區分大小寫
         * 2.寫代碼的期間始終保持輸入法是英文狀態
         * 3.一切代碼結尾家英文分號   ;
         */

        //程序執行到main的結束花括號 程序退出


        System.out.println("hello java!");//雙引號中的內容 所見即所得
        System.out.println(1);
        System.out.println(2);
        System.out.println(3);
        System.out.println("小熊維尼");
        System.out.println("┴┬┴┬／￣＼＿／￣＼   \n" +
                "┬┴┬┴▏　　▏▔▔▔▔＼   \n" +
                "┴┬┴／＼　／　　　　　　﹨   \n" +
                "┬┴∕　　　　　　　／　　　）   \n" +
                "┴┬▏　　　　　　　　●　　▏   \n" +
                "┬┴▏　　　　　　　　　　　▔█　   \n" +
                "┴◢██◣　　　　　＼＿＿＿／   \n" +
                "┬█████◣　　　　　　　／　　   \n" +
                "┴█████████████◣   \n" +
                "◢██████████████▆▄   \n" +
                "█◤◢██◣◥█████████◤＼   \n" +
                "◥◢████　████████◤　　 ＼   \n" +
                "┴█████　██████◤　　　　　 ﹨   \n" +
                "┬│　　　│█████◤　　　　　　　　▏   \n" +
                "┴│　　　│　　　　　　　　　　　　　　▏   \n" +
                "┬ ∕　　　 ∕　　　　／▔▔▔＼　　　　 ∕   \n" +
                "┴/＿＿＿／﹨　　　∕　　　　　﹨　　／＼   \n" +
                "┬┴┬┴┬┴＼ 　　 ＼ 　　　　　﹨／　　 ﹨   \n" +
                "┴┬┴┬┴┬┴ ＼＿＿＿＼　　　　 ﹨／▔＼﹨ ▔＼   \n" +
                "▲△▲▲╓╥╥╥╥╥╥╥╥＼　　 ∕　 ／▔﹨／▔﹨   \n" +
                "　  ＊＊╠╬╬╬╬╬╬╬╬＊﹨　　／　　／／");

    }

}
